benchmark/gwan.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        G-WAN
Server Hostname:        localhost
Server Port:            9104

Document Path:          /
Document Length:        391 bytes

Concurrency Level:      1000
Time taken for tests:   19.364 seconds
Complete requests:      100000
Failed requests:        66721
   (Connect: 0, Receive: 0, Length: 66721, Exceptions: 0)
Non-2xx responses:      33279
Total transferred:      6234979677 bytes
HTML transferred:       6211908145 bytes
Requests per second:    5164.15 [#/sec] (mean)
Time per request:       193.643 [ms] (mean)
Time per request:       0.194 [ms] (mean, across all concurrent requests)
Transfer rate:          314437.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   20   9.1     19      82
Processing:    25  172  58.8    199     373
Waiting:        0   95  19.5     95     280
Total:         77  193  56.3    218     425

Percentage of the requests served within a certain time (ms)
  50%    218
  66%    229
  75%    235
  80%    239
  90%    248
  95%    257
  98%    271
  99%    278
 100%    425 (longest request)