benchmark/lighttpd.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        lighttpd/1.4.64
Server Hostname:        localhost
Server Port:            9102

Document Path:          /
Document Length:        92919 bytes

Concurrency Level:      1000
Time taken for tests:   21.106 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      9313300000 bytes
HTML transferred:       9291900000 bytes
Requests per second:    4737.92 [#/sec] (mean)
Time per request:       211.063 [ms] (mean)
Time per request:       0.211 [ms] (mean, across all concurrent requests)
Transfer rate:          430914.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.3      0      52
Processing:    12  209  16.0    207     316
Waiting:        1  209  16.6    207     316
Total:         61  210  14.7    207     316

Percentage of the requests served within a certain time (ms)
  50%    207
  66%    211
  75%    213
  80%    214
  90%    219
  95%    230
  98%    244
  99%    271
 100%    316 (longest request)